base/Documents/бит_пз_ЗаявкаНаЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_пз_ЗаявкаНаЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатратыАналитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_пз_ВидыОперацийЗаявокНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_11</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_12</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/AccumulationRegisters/бит_пз_ПланируемыеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_пз_ПланируемыеЗатраты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаЗатраты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

base/Enums/бит_РежимыКонтроляПоБюджету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыКонтроляПоБюджету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикиДоговоров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_пз_ЗаявкаНаЗатраты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
#Область ОбновлениеИнформационнойБазы

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	// ++ ЕРП
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("ИсполнениеБюджетаРеквизиты", Новый ТаблицаЗначений);
	ПараметрыПроведения.Вставить("ИсполнениеБюджета", 		   Новый ТаблицаЗначений);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат    	 = Запрос.Выполнить();
	ТаблицаРеквизиты = Результат.Выгрузить();
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
		
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Реквизиты.Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   Реквизиты.ЦФО);
								
	КонтролироватьБюджет 	= бит_НастройкиПрограммы.КонтролироватьЗаявкуНаЗатратыПоБюджету(ПараметрыНастройки, Реквизиты.Период);
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиНаЗатратыПриКонтролеПоБюджету(ПараметрыНастройки,
								Реквизиты.Период);
								
	Запрос.УстановитьПараметр("КонтролироватьБюджет", 	 КонтролироватьБюджет);
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета", НеУчитыватьСверхБюджета);		
	
	ЗатратыПланируютсяСНДС = Константы.бит_пз_ЗатратыПланируютсяСНДС.Получить();
	Запрос.УстановитьПараметр("ЗатратыПланируютсяСНДС", ЗатратыПланируютсяСНДС);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПланируемыеЗатраты(НомераТаблиц)
				 + ТекстЗапросаПланируемыеЗатратыАналитика(НомераТаблиц)
				 + ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц);

	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	КурсыВалют = бит_Бюджетирование.КурсыВалютСценария(Реквизиты.Регистратор, Реквизиты.Период,
					Новый Структура("Документ, Регл, Сценарий"));
						
	Реквизиты.Вставить("КурсыВалют", КурсыВалют);
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	ПодготовитьТаблицыРасчетыВВалюте(ПараметрыПроведения, КурсыВалют);

	Для каждого СтрокаДокумента Из ПараметрыПроведения.ИсполнениеБюджета Цикл
		СтрокаДокумента.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
									СтрокаДокумента.Сумма, КурсыВалют.Документ, КурсыВалют.Сценарий);
	КонецЦикла;

	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ПараметрыРасчетаБюджета(Источник) Экспорт
	
	ПоляИсточника = Новый Массив;
	ПоляИсточника.Добавить("Аналитика_1");
	ПоляИсточника.Добавить("Аналитика_2");
	ПоляИсточника.Добавить("Аналитика_3");
	ПоляИсточника.Добавить("Аналитика_4");
	ПоляИсточника.Добавить("Аналитика_5");
	ПоляИсточника.Добавить("Аналитика_6");
	ПоляИсточника.Добавить("Аналитика_7");
	ПоляИсточника.Добавить("Аналитика_8");
	ПоляИсточника.Добавить("Аналитика_9");
	ПоляИсточника.Добавить("Аналитика_10");
	ПоляИсточника.Добавить("Аналитика_11");
	ПоляИсточника.Добавить("Аналитика_12");
	ПоляИсточника.Добавить("ВалютаДокумента");
	ПоляИсточника.Добавить("Дата");
	ПоляИсточника.Добавить("ЖелаемаяДатаПоступления");
	ПоляИсточника.Добавить("Договор");
	ПоляИсточника.Добавить("Контрагент");
	ПоляИсточника.Добавить("КратностьДокумента");
	ПоляИсточника.Добавить("КурсДокумента");
	ПоляИсточника.Добавить("Организация");
	ПоляИсточника.Добавить("СверхБюджета");
	ПоляИсточника.Добавить("СписатьЛимиты");
	ПоляИсточника.Добавить("Ссылка");
	ПоляИсточника.Добавить("СтатьяОборотов");
	ПоляИсточника.Добавить("Сумма");
	ПоляИсточника.Добавить("Сценарий");
	ПоляИсточника.Добавить("ЦФО");
	ИменаПолей = СтрСоединить(ПоляИсточника, ",");
	
	РеквизитыИсточника = Новый Структура(ИменаПолей);
	ЭтоСсылка          = (ТипЗнч(Источник) = Тип("ДокументСсылка.бит_пз_ЗаявкаНаЗатраты"));
	
	Если ЭтоСсылка Тогда
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, ИменаПолей);
	Иначе
		ЗаполнитьЗначенияСвойств(РеквизитыИсточника, Источник);
	КонецЕсли;
	
	ОтключитьКонтрольЗаявокПоЛимитам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыИсточника.Сценарий, 
																"ОтключитьКонтрольЗаявокПоЛимитам");
	
	РеквизитыИсточника.Вставить("ОтключитьКонтрольЗаявокПоЛимитам", ОтключитьКонтрольЗаявокПоЛимитам);
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ИсполнениеБюджетаРеквизиты", 
		бит_КонтрольИсполненияБюджета.ПустаяТаблицаИсполнениеБюджетаРеквизиты());
	ПараметрыРасчета.Вставить("ИсполнениеБюджета",
		бит_КонтрольИсполненияБюджета.ПустаяТаблицаИсполнениеБюджетаДляЦелейКонтроля());
		
	Если РеквизитыИсточника.ОтключитьКонтрольЗаявокПоЛимитам Тогда
		КонтролироватьБюджет = Ложь;
	Иначе	
		КонтролироватьБюджет = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(РеквизитыИсточника, РеквизитыИсточника.Дата);
	КонецЕсли;	
	
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(РеквизитыИсточника, 
									РеквизитыИсточника.Дата);
									
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",                  РеквизитыИсточника.Ссылка);
	Запрос.УстановитьПараметр("КонтролироватьБюджет", 	 КонтролироватьБюджет);
	Запрос.УстановитьПараметр("НеУчитыватьСверхБюджета", НеУчитыватьСверхБюджета);
	Запрос.УстановитьПараметр("СинонимСписка", 			 НСтр("ru = 'Потребности'; en = 'Requirements'"));
	ЗатратыПланируютсяСНДС = Константы.бит_пз_ЗатратыПланируютсяСНДС.Получить();
	Запрос.УстановитьПараметр("ЗатратыПланируютсяСНДС",  ЗатратыПланируютсяСНДС);
	
	ВалютаСценария = РеквизитыИсточника.ВалютаДокумента;
	Если ЗначениеЗаполнено(РеквизитыИсточника.Сценарий) Тогда
		ВалютаСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыИсточника.Сценарий, "Валюта");
	КонецЕсли;
	
	Если ЭтоСсылка Тогда
		НомераТаблиц = Новый Структура;
		Запрос.Текст = ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц);
		Результат    = Запрос.ВыполнитьПакет();
		Для каждого НомерТаблицы Из НомераТаблиц Цикл
			ПараметрыРасчета.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
		КонецЦикла;	
	Иначе
		ИсполнениеБюджетаРеквизиты = ПараметрыРасчета.ИсполнениеБюджетаРеквизиты;
		СтрокаРеквизитов           = ИсполнениеБюджетаРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, РеквизитыИсточника);
		СтрокаРеквизитов.ВалютаСценария          = ВалютаСценария;
		СтрокаРеквизитов.КонтролироватьБюджет    = КонтролироватьБюджет;
		СтрокаРеквизитов.НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета;
		СтрокаРеквизитов.Регистратор             = РеквизитыИсточника.Ссылка;
		СтрокаРеквизитов.РежимКонтроля           = Перечисления.бит_РежимыКонтроляПоБюджету.Заявки;
		СтрокаРеквизитов.СценарийКонтролируемый  = РеквизитыИсточника.Сценарий;
		
		ИсполнениеБюджета = ПараметрыРасчета.ИсполнениеБюджета;
		СтрокаИсполенения = ИсполнениеБюджета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИсполенения, РеквизитыИсточника);
		СтрокаИсполенения.Период                 = РеквизитыИсточника.ЖелаемаяДатаПоступления;
		СтрокаИсполенения.КонтролироватьСумму    = Истина;
		
		КонтролироватьПоСтатье = Ложь;
		Если ЗначениеЗаполнено(РеквизитыИсточника.СтатьяОборотов) Тогда
			КонтролироватьПоСтатье = НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыИсточника.СтатьяОборотов,
																					"НеКонтролировать_Заявки");
		КонецЕсли;
		СтрокаИсполенения.КонтролироватьПоСтатье = КонтролироватьПоСтатье;
	КонецЕсли;
	
	КурсДокумента = Новый Структура;
	КурсДокумента.Вставить("Курс"     , РеквизитыИсточника.КурсДокумента);
	КурсДокумента.Вставить("Кратность", РеквизитыИсточника.КратностьДокумента);
	КурсДокумента.Вставить("Валюта"   , РеквизитыИсточника.ВалютаДокумента);
	КурсВалютыСценария = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСценария, РеквизитыИсточника.Дата);

	Для каждого СтрокаДокумента Из ПараметрыРасчета.ИсполнениеБюджета Цикл
		СтрокаДокумента.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
									СтрокаДокумента.Сумма, КурсДокумента, КурсВалютыСценария);
	КонецЦикла;

	Возврат ПараметрыРасчета;
	
КонецФункции

// Функция получает структуру остатков документа для установки статуса.
//
// Параметры:
//   ЗаявкаНаЗатраты - ДокументСсылка.бит_пз_ЗаявкаНаЗатраты
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстаткиДляУстановкиСтатуса(ЗаявкаНаЗатраты) Экспорт

	СтрОплата = Новый Структура("КоличествоПлан, КоличествоФакт, КоличествоОстаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкаНаЗатраты"     , ЗаявкаНаЗатраты);
	Запрос.УстановитьПараметр("МоментВремени"     	, ТекущаяДатаСеанса());
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатратыОбороты.КоличествоПриход, 0)) КАК КоличествоПлан,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатратыОбороты.СуммаПриход, 0)) КАК СуммаПлан,
	               |	СУММА(0) КАК КоличествоФакт,
	               |	СУММА(0) КАК СуммаФакт
	               |ПОМЕСТИТЬ Заявка
	               |ИЗ
	               |	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Обороты(, , Авто, ЗаявкаНаЗатраты = &ЗаявкаНаЗатраты) КАК ПланируемыеЗатратыОбороты
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ПланируемыеЗатратыОбороты.Регистратор) = ТИП(Документ.бит_пз_ЗаявкаНаЗатраты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(0) КАК КоличествоПлан,
	               |	СУММА(0) КАК СуммаПлан,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатратыОбороты.КоличествоРасход, 0)) КАК КоличествоФакт,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатратыОбороты.СуммаРасход, 0)) КАК СуммаФакт
	               |ПОМЕСТИТЬ ОтражениеФакта
	               |ИЗ
	               |	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Обороты(, , Авто, ЗаявкаНаЗатраты = &ЗаявкаНаЗатраты) КАК ПланируемыеЗатратыОбороты
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ПланируемыеЗатратыОбороты.Регистратор) = ТИП(Документ.бит_пз_ОтражениеФактаЗатрат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(Заявка.КоличествоПлан, 0) + ЕСТЬNULL(ОтражениеФакта.КоличествоПлан, 0)) КАК КоличествоПлан,
	               |	СУММА(ЕСТЬNULL(Заявка.КоличествоФакт, 0) + ЕСТЬNULL(ОтражениеФакта.КоличествоФакт, 0)) КАК КоличествоФакт,
	               |	СУММА(ЕСТЬNULL(Заявка.КоличествоПлан, 0) + ЕСТЬNULL(ОтражениеФакта.КоличествоПлан, 0) - (ЕСТЬNULL(Заявка.КоличествоФакт, 0) + ЕСТЬNULL(ОтражениеФакта.КоличествоФакт, 0))) КАК КоличествоОстаток,
	               |	СУММА(ЕСТЬNULL(Заявка.СуммаПлан, 0) + ЕСТЬNULL(ОтражениеФакта.СуммаПлан, 0)) КАК СуммаПлан,
	               |	СУММА(ЕСТЬNULL(Заявка.СуммаФакт, 0) + ЕСТЬNULL(ОтражениеФакта.СуммаФакт, 0)) КАК СуммаФакт,
	               |	СУММА(ЕСТЬNULL(Заявка.СуммаПлан, 0) + ЕСТЬNULL(ОтражениеФакта.СуммаПлан, 0) - (ЕСТЬNULL(Заявка.СуммаФакт, 0) + ЕСТЬNULL(ОтражениеФакта.СуммаФакт, 0))) КАК СуммаОстаток
	               |ИЗ
	               |	Заявка КАК Заявка,
	               |	ОтражениеФакта КАК ОтражениеФакта";
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтрОплата, Выборка);
		
	КонецЕсли; 
	
	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаткиДляУстановкиСтатуса()

// Функция получает структуру остатков документа.
//
// Параметры:
//   ЗаявкаНаЗатраты - ДокументСсылка.бит_пз_ЗаявкаНаЗатраты
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатки(ЗаявкаНаЗатраты) Экспорт

	СтрОплата = Новый Структура("КоличествоПлан, КоличествоФакт, КоличествоОстаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ЗаявкаНаЗатраты);
	Запрос.УстановитьПараметр("Организация"         , ЗаявкаНаЗатраты.Организация);
	Запрос.УстановитьПараметр("ЗаявкаНаЗатраты"     , ЗаявкаНаЗатраты);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоКонечныйОстаток, 0)) КАК КоличествоОстаток,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоПриход, 0)) КАК КоличествоПлан,
	               |	СУММА(ЕСТЬNULL(ПланируемыеЗатраты.КоличествоРасход, 0)) КАК КоличествоФакт
	               |ИЗ
	               |	РегистрНакопления.бит_пз_ПланируемыеЗатраты.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			,
	               |			,
	               |			ДокументПланирования = &ДокументПланирования
	               |				И Организация = &Организация
	               |				И ЗаявкаНаЗатраты = &ЗаявкаНаЗатраты) КАК ПланируемыеЗатраты";
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.КоличествоПлан 	= ?(ЗначениеЗаполнено(Выборка.КоличествоПлан)	, Выборка.КоличествоПлан, 0);
		СтрОплата.КоличествоФакт 	= ?(ЗначениеЗаполнено(Выборка.КоличествоФакт)	, Выборка.КоличествоФакт, 0);
		СтрОплата.КоличествоОстаток = ?(ЗначениеЗаполнено(Выборка.КоличествоОстаток), Выборка.КоличествоОстаток, 0);
		
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстатки()

// Функция получает остатки номенклатуры из регистра Планируемые затраты.
//
// Параметры:
//   ЗаявкаНаЗатраты - ДокументСсылка.бит_пз_ЗаявкаНаЗатраты
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстаткиНоменклатуры(ЗаявкаНаЗатраты) Экспорт

	СтрОплата = Новый Структура("КоличествоПлан, КоличествоФакт, КоличествоОстаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ЗаявкаНаЗатраты);
	Запрос.УстановитьПараметр("Организация"         , ЗаявкаНаЗатраты.Организация);
	Запрос.УстановитьПараметр("ЗаявкаНаЗатраты"     , ЗаявкаНаЗатраты);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланируемыеЗатратыОстатки.Номенклатура,
	               |	ПланируемыеЗатратыОстатки.Организация,
	               |	ПланируемыеЗатратыОстатки.ЗаявкаНаЗатраты,
	               |	ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0) КАК Количество,
	               |	ПланируемыеЗатратыАналитика.Контрагент,
	               |	ПланируемыеЗатратыАналитика.Договор,
	               |	ПланируемыеЗатратыАналитика.ВалютаДокумента,
	               |	ПланируемыеЗатратыАналитика.Сценарий,
	               |	ПланируемыеЗатратыАналитика.Важность,
	               |	ПланируемыеЗатратыАналитика.Склад,
	               |	ПланируемыеЗатратыАналитика.СтатьяОборотов,
	               |	ПланируемыеЗатратыАналитика.ЦФО,
	               |	ПланируемыеЗатратыАналитика.Аналитика_1,
	               |	ПланируемыеЗатратыАналитика.Аналитика_2,
	               |	ПланируемыеЗатратыАналитика.Аналитика_3,
	               |	ПланируемыеЗатратыАналитика.Аналитика_4,
	               |	ПланируемыеЗатратыАналитика.Аналитика_5,
	               |	ПланируемыеЗатратыАналитика.Аналитика_6,
	               |	ПланируемыеЗатратыАналитика.Аналитика_7,
	               |	ПланируемыеЗатратыАналитика.Аналитика_8,
	               |	ПланируемыеЗатратыАналитика.Аналитика_9,
	               |	ПланируемыеЗатратыАналитика.Аналитика_10,
	               |	ПланируемыеЗатратыАналитика.Аналитика_11,
	               |	ПланируемыеЗатратыАналитика.Аналитика_12,
	               |	ПланируемыеЗатратыАналитика.Ответственный,
	               |	ПланируемыеЗатратыАналитика.Инициатор,
	               |	ПланируемыеЗатратыАналитика.НоменклатураПоставщика,
	               |	ПланируемыеЗатратыАналитика.Упаковка,
	               |	ПланируемыеЗатратыАналитика.ВидОперации,
	               |	ПланируемыеЗатратыАналитика.СтавкаНДС,
	               |	ЕСТЬNULL(ПланируемыеЗатратыАналитика.Цена, 0) КАК Цена,
	               |	ЕСТЬNULL(ПланируемыеЗатратыАналитика.Сумма, 0) * ЕСТЬNULL(ПланируемыеЗатратыОстатки.КоличествоОстаток, 0) / ЕСТЬNULL(ПланируемыеЗатратыАналитика.Количество, 0) КАК Сумма,
	               |	ПланируемыеЗатратыАналитика.Содержание,
	               |	ПланируемыеЗатратыАналитика.Комментарий,
	               |	ПланируемыеЗатратыОстатки.Характеристика
	               |ИЗ
	               |	РегистрНакопления.бит_пз_ПланируемыеЗатраты.Остатки({(&КонецПериода)}, ТИПЗНАЧЕНИЯ(ДокументПланирования) = ТИП(Документ.бит_пз_ЗаявкаНаЗатраты)) КАК ПланируемыеЗатратыОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_пз_ПланируемыеЗатратыАналитика КАК ПланируемыеЗатратыАналитика
	               |		ПО ПланируемыеЗатратыОстатки.ЗаявкаНаЗатраты = ПланируемыеЗатратыАналитика.ЗаявкаНаЗатраты
	               |			И ПланируемыеЗатратыОстатки.Организация = ПланируемыеЗатратыАналитика.Организация
	               |			И ПланируемыеЗатратыОстатки.ДокументПланирования = ПланируемыеЗатратыАналитика.ДокументПланирования
	               |			И ПланируемыеЗатратыОстатки.Номенклатура = ПланируемыеЗатратыАналитика.Номенклатура
	               |			И ПланируемыеЗатратыОстатки.Характеристика = ПланируемыеЗатратыАналитика.Характеристика
	               |ГДЕ
	               |	ПланируемыеЗатратыОстатки.ЗаявкаНаЗатраты = &ЗаявкаНаЗатраты
	               |	И ПланируемыеЗатратыОстатки.ДокументПланирования = &ДокументПланирования
	               |	И ПланируемыеЗатратыОстатки.Организация = &Организация";
				   
	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;
	
КонецФункции // ПолучитьОстаткиНоменклатуры()

// Функция находит аналитики тип которых совпадает с типом реквизитов документа.
//
// Параметры: 
//   МетаОбъект - ОбъектМетаданных
//
// Возвращаемое значение:
//   СовпадающиеАналитики - Соответствие.
//
Функция НайтиАналитикиСовпадающиеСРеквизитами(МетаОбъект) Экспорт 

	СовпадающиеАналитики = Новый Соответствие;
	
	МассивТипов = Новый Массив;
	
	Для каждого Реквизит Из МетаОбъект.Реквизиты Цикл
	
		Если Найти(Реквизит.Имя, "Аналитика")=0 Тогда
		
			Для каждого ТипРек Из Реквизит.Тип.Типы() Цикл
			
				Если НЕ ТипРек = Тип("Булево")
					И НЕ ТипРек = Тип("Дата")
					И НЕ ТипРек = Тип("Строка")
					И НЕ ТипРек = Тип("Число") Тогда
					
					СтрРекв = Новый Структура("Имя, Тип", Реквизит.Имя, ТипРек);
					МассивТипов.Добавить(СтрРекв);
				
				КонецЕсли; 
			
			КонецЦикла; 
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Настр = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналит Из Настр Цикл
		
		Если НЕ Аналит.Значение.ЭтоСоставнойТип Тогда 
		
			Для каждого СтрРекв Из МассивТипов Цикл
				
				ТипРек = СтрРекв.Тип;
				Если Аналит.Значение.ТипЗначения.СодержитТип(ТипРек) Тогда 
					СовпадающиеАналитики.Вставить(Аналит.Ключ, СтрРекв.Имя);
					Прервать;
				КонецЕсли;
			
			КонецЦикла; 
			
		КонецЕсли;	
			
	КонецЦикла; 
	
	Возврат СовпадающиеАналитики;
	
КонецФункции // НайтиАналитикиСовпадающиеСРеквизитами()

// Функция выполняет поиск сводной заявки по заявке на затраты.
//
// Параметры: 
//   ЗаявкаНаЗатраты - ДокументСсылка.бит_пз_ЗаявкаНаЗатраты.
//
Функция НайтиСводнуюЗаявкуНаЗатраты(ЗаявкаНаЗатраты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкаНаЗатраты", ЗаявкаНаЗатраты);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СводнаяЗаявкаНаЗатраты.Ссылка
	               |ИЗ
	               |	Документ.бит_пз_СводнаяЗаявкаНаЗатраты.ЗаявкиНаЗатраты КАК СводнаяЗаявкаНаЗатраты
	               |ГДЕ
	               |	СводнаяЗаявкаНаЗатраты.ЗаявкаНаЗатраты = &ЗаявкаНаЗатраты
	               |	И СводнаяЗаявкаНаЗатраты.Ссылка.Проведен = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // НайтиСводнуюЗаявкуНаЗатраты()

Функция ДоступностьХарактеристики(Номенклатура) Экспорт 

	ДоступностьХарактеристики = Истина;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
	Если ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
		ДоступностьХарактеристики = Ложь;
	КонецЕсли; 
	
	Возврат ДоступностьХарактеристики;
	
КонецФункции

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_пз_ЗаявкаНаЗатраты.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если Справочники.бит_СтатусыОбъектов.ПроверитьТипСтатуса(ПараметрыУстановкиСтатуса.ТекущийСтатус,
			Перечисления.бит_ТипыСтатусовОбъектов.Закрыт) Тогда
		Возврат ПараметрыУстановкиСтатуса.ТекущийСтатус;
	КонецЕсли;
		
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураОплаты = ПолучитьОстаткиДляУстановкиСтатуса(ТекущийОбъект.Ссылка);
	Иначе	
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ ТекущийОбъект.Проведен) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	ОтменаСводнойЗаявки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ОтменаСводнойЗаявки", Ложь);
	
	Если бит_ВизированиеСервер.ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
		
	ИначеЕсли СтруктураОплаты.КоличествоОстаток <= 0.01 И СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_Исполнена;
		
	ИначеЕсли СтруктураОплаты.КоличествоФакт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ЧастичноИсполнена;
		
	ИначеЕсли Документы.бит_пз_ЗаявкаНаЗатраты.НайтиСводнуюЗаявкуНаЗатраты(СсылкаНаОбъект)
				И НЕ ОтменаСводнойЗаявки Тогда
				
		Возврат Справочники.бит_СтатусыОбъектов.ЗаявкаНаЗатраты_ВключенаВСводнуюЗаявку;
		
	ИначеЕсли бит_ВизированиеСервер.ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
		
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

Процедура СформироватьПланируемыеЗатраты(ПланируемыеЗатраты, ТаблицаРеквизиты, Движения, Отказ) Экспорт

	Если НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) ИЛИ НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для каждого СтрокаТаблицы Из ПланируемыеЗатраты Цикл
		НоваяСтрока = Движения.бит_пз_ПланируемыеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_пз_ПланируемыеЗатраты.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьПланируемыеЗатратыАналитика(ПланируемыеЗатраты, ТаблицаРеквизиты, Движения, Отказ) Экспорт

	Если НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) ИЛИ НЕ ЗначениеЗаполнено(ПланируемыеЗатраты) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для каждого СтрокаТаблицы Из ПланируемыеЗатраты Цикл
		НоваяСтрока = Движения.бит_пз_ПланируемыеЗатратыАналитика.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла; 
	Движения.бит_пз_ПланируемыеЗатратыАналитика.Записывать = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПланируемыеЗатраты(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПланируемыеЗатратыРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПланируемыеЗатраты", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Ссылка КАК ДокументПланирования,
	|	Реквизиты.Ссылка КАК ЗаявкаНаЗатраты,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ЖелаемаяДатаПоступления КАК Период
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Количество КАК Количество,
	|	Таблица.СуммаСНДС КАК Сумма
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты.Товары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_пз_ВидыОперацийЗаявокНаЗатраты.Товары)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	Реквизиты.СтатьяОборотов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	Реквизиты.Количество,
	|	Реквизиты.СуммаСНДС
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_пз_ВидыОперацийЗаявокНаЗатраты.Товары)";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПланируемыеЗатратыАналитика(НомераТаблиц)

	НомераТаблиц.Вставить("ПланируемыеЗатратыАналитикаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПланируемыеЗатратыАналитика", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Ссылка КАК ЗаявкаНаЗатраты,
	|	Реквизиты.Ссылка КАК ДокументПланирования,
	|	Реквизиты.ЖелаемаяДатаПоступления КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.Договор КАК Договор,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Важность КАК Важность,
	|	Реквизиты.Склад КАК Склад,
	|	Реквизиты.СтатьяОборотов КАК СтатьяОборотов,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Аналитика_1 КАК Аналитика_1,
	|	Реквизиты.Аналитика_2 КАК Аналитика_2,
	|	Реквизиты.Аналитика_3 КАК Аналитика_3,
	|	Реквизиты.Аналитика_4 КАК Аналитика_4,
	|	Реквизиты.Аналитика_5 КАК Аналитика_5,
	|	Реквизиты.Аналитика_6 КАК Аналитика_6,
	|	Реквизиты.Аналитика_7 КАК Аналитика_7,
	|	Реквизиты.Аналитика_8 КАК Аналитика_8,
	|	Реквизиты.Аналитика_9 КАК Аналитика_9,
	|	Реквизиты.Аналитика_10 КАК Аналитика_10,
	|	Реквизиты.Аналитика_11 КАК Аналитика_11,
	|	Реквизиты.Аналитика_12 КАК Аналитика_12,
	|	Реквизиты.Ответственный КАК Ответственный,
	|	Реквизиты.Инициатор КАК Инициатор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Комментарий КАК Комментарий,
	|	Реквизиты.КурсДокумента КАК КурсДокумента,
	|	Реквизиты.КратностьДокумента КАК КратностьДокумента
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Таблица.Содержание КАК Содержание,
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Количество КАК Количество,
	|	Таблица.Цена КАК Цена,
	|	Таблица.Сумма КАК Сумма,
	|	Таблица.СтавкаНДС КАК СтавкаНДС,
	|	Таблица.СуммаНДС КАК СуммаНДС,
	|	Таблица.СуммаСНДС КАК СуммаСНДС,
	|	Таблица.ДатаПоступления КАК ДатаПоступления,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаСНДСРегл
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты.Товары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_пз_ВидыОперацийЗаявокНаЗатраты.Товары)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	Реквизиты.СтатьяОборотов,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.Содержание,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.Количество,
	|	Реквизиты.Цена,
	|	Реквизиты.Сумма,
	|	Реквизиты.СтавкаНДС,
	|	Реквизиты.СуммаНДС,
	|	Реквизиты.СуммаСНДС,
	|	Реквизиты.ЖелаемаяДатаПоступления,
	|	0,
	|	0
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_пз_ВидыОперацийЗаявокНаЗатраты.Товары)";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаКонтрольИсполненияБюджета(НомераТаблиц)
	
	НомераТаблиц.Вставить("ИсполнениеБюджетаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИсполнениеБюджета", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ЖелаемаяДатаПоступления КАК Период,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.Сценарий КАК Сценарий,
	|	Реквизиты.Сценарий КАК СценарийКонтролируемый,
	|	Реквизиты.СтатьяОборотов КАК СтатьяОборотов,
	|	Реквизиты.КурсДокумента КАК Курс,
	|	Реквизиты.КратностьДокумента КАК Кратность,
	|	Реквизиты.Сценарий.Валюта КАК ВалютаСценария,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыКонтроляПоБюджету.Заявки) КАК РежимКонтроля,
	|	&КонтролироватьБюджет КАК КонтролироватьБюджет,
	|	&НеУчитыватьСверхБюджета КАК НеУчитыватьСверхБюджета,
	|	Реквизиты.СверхБюджета КАК СверхБюджета,
	|	Реквизиты.СписатьЛимиты КАК СписатьЛимиты
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Распределение"" КАК ИмяСписка,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(25)) КАК СинонимСписка,
	|	1 КАК НомерСтроки,
	|	Реквизиты.ЖелаемаяДатаПоступления КАК Период,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.СтатьяОборотов КАК СтатьяОборотов,
	|	Реквизиты.Аналитика_1 КАК Аналитика_1,
	|	Реквизиты.Аналитика_2 КАК Аналитика_2,
	|	Реквизиты.Аналитика_3 КАК Аналитика_3,
	|	Реквизиты.Аналитика_4 КАК Аналитика_4,
	|	Реквизиты.Аналитика_5 КАК Аналитика_5,
	|	Реквизиты.Аналитика_6 КАК Аналитика_6,
	|	Реквизиты.Аналитика_7 КАК Аналитика_7,
	|	Реквизиты.Аналитика_8 КАК Аналитика_8,
	|	Реквизиты.Аналитика_9 КАК Аналитика_9,
	|	Реквизиты.Аналитика_10 КАК Аналитика_10,
	|	Реквизиты.Аналитика_11 КАК Аналитика_11,
	|	Реквизиты.Аналитика_12 КАК Аналитика_12,
	|	Реквизиты.Сумма + ВЫБОР
	|		КОГДА &ЗатратыПланируютсяСНДС
	|			ТОГДА Реквизиты.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	0 КАК Количество,
	|	ИСТИНА КАК КонтролироватьСумму,
	|	ЛОЖЬ КАК КонтролироватьКоличество,
	|	НЕ Реквизиты.СтатьяОборотов.НеКонтролировать_Заявки КАК КонтролироватьПоСтатье
	|ИЗ
	|	Документ.бит_пз_ЗаявкаНаЗатраты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции
 
Процедура ПодготовитьТаблицыРасчетыВВалюте(ПараметрыПроведения, КурсыВалют)
	
	Для каждого СтрокаТаблицы Из ПараметрыПроведения.ПланируемыеЗатратыАналитика Цикл
		СтрокаТаблицы.СуммаРегл 	= РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
											СтрокаТаблицы.Сумма, КурсыВалют.Документ, КурсыВалют.Регл);
		СтрокаТаблицы.СуммаСНДСРегл =  РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
											СтрокаТаблицы.СуммаСНДС, КурсыВалют.Документ, КурсыВалют.Регл);
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
